---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DividedPath
source: html/aa68441f-f4cd-09c0-8730-a8763058b84b.htm
---
# DividedPath Members

This checks if the references represent a connected set of curves as required by the divided path.